advanced/frontend/controllers/UserController.php

DELETE FROM `home` WHERE h_id in (15,16,17,18)
---
	public function actionDels()
	{
		$request = Yii::$app->request->post();
        $a_ids='';
        foreach ($request as $v){
//            print_r($v);
            for ($i=0;$i<count($v);$i++){
                $a_ids.=$v[$i].",";
            }
        }
        $a_ids=trim($a_ids,",");
//        echo  $a_ids;
        $res=Yii::$app->db->createCommand()->delete("home","h_id in ($a_ids)")->execute();